Hey, @treywelsh,

Yes, I could reproduce the problem using your test file; only used a different size for the images as I don't have that much space on the default datastore.

Didn't mention it initially, also running on OpenNebula 6.4.0 (deployed via minione).

Initial run:
```
  # opennebula_virtual_machine.vm will be created                                                                                                                                                                                                                       [53/1430]
  + resource "opennebula_virtual_machine" "vm" {
      + cpu            = 1                           
      + default_tags   = (known after apply)
      + description    = "test"
      + gid            = (known after apply)
      + gname          = (known after apply)
      + group          = "oneadmin"
      + hard_shutdown  = false    
      + id             = (known after apply)          
      + ip             = (known after apply)           
      + lcmstate       = (known after apply)              
      + memory         = 768                               
      + name           = "testvm"         
      + on_disk_change = "SWAP"                               
      + pending        = false                                     
      + permissions    = "660"
      + state          = (known after apply)               
      + tags_all       = (known after apply)      
      + template_disk  = (known after apply)       
      + template_id    = -1                       
      + template_nic   = (known after apply)               
      + template_tags  = (known after apply)
      + timeout        = 20                                                                                                                                                                                                                                                      
      + uid            = (known after apply)
      + uname          = (known after apply)
      + vcpu           = 1                   

      + disk {                                            
          + computed_cache           = (known after apply)
          + computed_dev_prefix      = (known after apply)
          + computed_discard         = (known after apply)
          + computed_driver          = (known after apply)
          + computed_io              = (known after apply)
          + computed_size            = (known after apply)
          + computed_target          = (known after apply)
          + computed_volatile_format = (known after apply)
          + disk_id                  = (known after apply)
          + driver                   = "qcow2"
          + image_id                 = (known after apply)
          + size                     = 4096
          + target                   = "vda"
        }                
      + disk {             
          + computed_cache           = (known after apply)
          + computed_dev_prefix      = (known after apply)
          + computed_discard         = (known after apply)
          + computed_driver          = (known after apply)
          + computed_io              = (known after apply)
          + computed_size            = (known after apply)
          + computed_target          = (known after apply)
          + computed_volatile_format = (known after apply)
          + disk_id                  = (known after apply)
          + driver                   = "qcow2"
          + image_id                 = (known after apply)
          + size                     = 3072
          + target                   = "vdb"
        }

      + vmgroup {
          + role       = (known after apply)
          + vmgroup_id = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

Subsequent run:

```
  # opennebula_virtual_machine.vm will be updated in-place
  ~ resource "opennebula_virtual_machine" "vm" {
        id             = "158"
        name           = "testvm"
        # (22 unchanged attributes hidden)

      + disk {
          + driver   = "qcow2"
          + image_id = 28
          + size     = 4096
          + target   = "vda"
        }
      + disk {
          + driver   = "qcow2"
          + image_id = 29
          + size     = 3072
          + target   = "vdb"
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```